import numpy as np

PIPELINE_COORDS = {
    'MT-01': np.array([[47.1,51.9],[47.5,52.8],[50.3,57.1],[54.8,69.1]]),
    'MT-02': np.array([[43.65,51.15],[43.35,52.85],[42.3,69.6],[49.8,73.1]]),
    'MT-03': np.array([[46.35,52.78],[51.2,51.4],[52.3,76.9],[50.4,80.2]]),
    'MT-04': np.array([[47.1,51.9],[46.35,52.78],[43.65,51.15],[42.3,69.6]])
}

PIPELINE_COORDS_POLYLINE = {
    'MT-01': [[47.1,51.9],[47.5,52.8],[50.3,57.1],[54.8,69.1]],
    'MT-02': [[43.65,51.15],[43.35,52.85],[42.3,69.6],[49.8,73.1]],
    'MT-03': [[46.35,52.78],[51.2,51.4],[52.3,76.9],[50.4,80.2]],
    'MT-04': [[47.1,51.9],[46.35,52.78],[43.65,51.15],[42.3,69.6]]
}

PIPELINE_NAMES = {
    'MT-01': 'Main Trunk 01: Атырау − Актобе − Павлодар',
    'MT-02': 'Main Trunk 02: Актау − Жанаозен − Шымкент − Караганда',
    'MT-03': 'Main Trunk 03: Тенгиз − Уральск − Алматы − Семей',
    'MT-04': 'Main Trunk 04: Южный соединитель (Атырау − Тенгиз − Актау)'
}

COLOR_MAP = {'high': '#FF3333', 'medium': '#FFAA00', 'normal': '#33AA33', None: '#888888'}
RISK_TEXT = {'high': 'ВЫСОКИЙ', 'medium': 'СРЕДНИЙ', 'normal': 'НОРМА', None: 'НЕТ ДАННЫХ'}